//
//  AppConstants.swift
//  FitGuide
//
//  Created by Антон Баландин on 16.05.24.
//

import Foundation

struct AppConstants {
    static let telegramLink = "https://t.me/+375336886070"
    static let loginTextFieldText = "Enter your login"
    static let passwordTextFieldText = "Enter your password"
    static let idealBodyMassIndexInfo = "Эти диапазоны являются общими рекомендациями. Важно помнить, что ИМТ не учитывает все факторы, такие как процент жира, распределение жировой ткани и мускулатуру, поэтому всегда рекомендуется консультироваться с врачом для более точной оценки состояния здоровья"
    static let idealBodyMassIndexForMale = "Идеальный индекс массы тела для мужчины равен 23"
    static let idealBodyMassIndexForFemale = "Идеальный индекс массы тела для женщины равен 21.5"
    static let incorrectDataMessage = "Введите корректные данные пользователя"
    static let incorrectLoginOrPassword = "Incorrect login or password"
    static let userExistsMessage = "This user already exists"
    
    static let description = """
            Добро пожаловать в наше приложение по составлению программы тренировок в тренажерном зале! Мы рады приветствовать тебя в нашем фитнес-мире, где ты сможешь создать идеальную программу тренировок, а также получить максимальные результаты.
            
            Приложение разработано с учетом потребностей как начинающих спортсменов, так и опытных тренирующихся. Мы предлагаем удобный и интуитивно понятный интерфейс, который позволит тебе легко составить программу тренировок, подходящую именно тебе.
            
            Мы поможем вам пользователю составить корректную программу тренировок в соответствии с текущим состоянием тела и антропометрическими параметрами. Тренировки предусматривают различные цели (набор мышечной массы, сжигагние излишнего подкожного жира)
            
            Программа предусматривает трехдневный режим тернировок, которые генерируются в случайном порядке, что сделает ваш путь к идеальному телу разнообразным и интересным
            
            Команда разработчиков предлагает вам тренировочную программу по сплиту следующей схемы:
            
                 ДЕНЬ 1: Спина + Трицепс
                 ДЕНЬ 2: ОТДЫХ
                 ДЕНЬ 3: Грудь + Бицепс
                 ДЕНЬ 4: ОТДЫХ
                 ДЕНЬ 5: Ноги + Плечи
                 ДЕНЬ 6: ОТДЫХ
                 ДЕНЬ 7: ОТДЫХ
            
            В свою очередь, пользователь может корректировать ее в соответствии со своими пожеланиями
            
            Так что не теряй время и приступай к тренировкам уже сегодня! Дарим тебе возможность преобразить свое тело и достичь желаемых результатов. Успехов и приятных тренировок!
            
            
            Разработчик:
            Баландин Антон Викторович
            Зинченко Ольга Валериановна
            """
}
